In [2]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
from numpy.random   import randn

In [5]:
np.random.seed(101) #to get same random numbers

In [6]:
df = pd.DataFrame(randn(5,4),['a','b','c','d','e'],['w','x','y','z'])

In [7]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [8]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [9]:
df[['x','z']]

          x         z
a  0.628133  0.503826
b -0.319318  0.605965
c  0.740122 -0.589001
d -0.758872  0.955057
e  1.978757  0.683509

In [10]:
type(df['x'])

pandas.core.series.Series

In [11]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

for

In [12]:
df.loc['a']

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [13]:
df.iloc[0]

w    2.706850
x    0.628133
y    0.907969
z    0.503826
Name: a, dtype: float64

In [14]:
df['new']= df['w']+ df['z']

In [15]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [16]:
df.drop('new',axis=1)

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [17]:
df.drop('a')

          w         x         y         z       new
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [18]:
df

          w         x         y         z       new
a  2.706850  0.628133  0.907969  0.503826  3.210676
b  0.651118 -0.319318 -0.848077  0.605965  1.257083
c -2.018168  0.740122  0.528813 -0.589001 -2.607169
d  0.188695 -0.758872 -0.933237  0.955057  1.143752
e  0.190794  1.978757  2.605967  0.683509  0.874303

In [19]:
df.drop('new',axis =1,inplace=True)

In [20]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [21]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [22]:
#conditional in pandas

In [23]:
df>0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [24]:
booldf = df>0 #conditional selection

In [25]:
booldf

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [26]:
df[booldf]#to get only positive valued in dataframe

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [27]:
df[df>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [28]:
df

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [30]:
df['w']

a    2.706850
b    0.651118
c   -2.018168
d    0.188695
e    0.190794
Name: w, dtype: float64

In [29]:
df['w']>0

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [31]:
df[df['w']>0]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [33]:
df[df['w']>0]['y'] # in df where w is greater than 0 print y column

a    0.907969
b   -0.848077
d   -0.933237
e    2.605967
Name: y, dtype: float64

In [32]:
df[df['z']<0]

          w         x         y         z
c -2.018168  0.740122  0.528813 -0.589001

In [36]:
df[(df['w']>0) & (df['y']>0)]

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
e  0.190794  1.978757  2.605967  0.683509

 # use '&' instead of 'and' keyword , '|' instead of 'or'

In [37]:
df.reset_index()

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [40]:
newIndex = 'MP UP AP TN HP'.split()

In [41]:
newIndex

['MP', 'UP', 'AP', 'TN', 'HP']

In [44]:
df['State']=newIndex

In [45]:
df

          w         x         y         z State
a  2.706850  0.628133  0.907969  0.503826    MP
b  0.651118 -0.319318 -0.848077  0.605965    UP
c -2.018168  0.740122  0.528813 -0.589001    AP
d  0.188695 -0.758872 -0.933237  0.955057    TN
e  0.190794  1.978757  2.605967  0.683509    HP

In [46]:
df.set_index('State')

              w         x         y         z
State
MP     2.706850  0.628133  0.907969  0.503826
UP     0.651118 -0.319318 -0.848077  0.605965
AP    -2.018168  0.740122  0.528813 -0.589001
TN     0.188695 -0.758872 -0.933237  0.955057
HP     0.190794  1.978757  2.605967  0.683509

In [47]:
#IndexLevels
outside=['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [49]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [50]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [52]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [53]:
df.index.names

FrozenList([None, None])

In [54]:
df.index.names=['Groups','Nums']

In [55]:
df

                    A         B
Groups Nums
G1     1     0.302665  1.693723
       2    -1.706086 -1.159119
       3    -0.134841  0.390528
G2     1     0.166905  0.184502
       2     0.807706  0.072960
       3     0.638787  0.329646

In [58]:
df.loc['G2'].loc[2].loc['B']

0.07295967531703869

In [62]:
df.loc['G1']

             A         B
Nums
1     0.302665  1.693723
2    -1.706086 -1.159119
3    -0.134841  0.390528

In [61]:
df.xs('G1')

             A         B
Nums
1     0.302665  1.693723
2    -1.706086 -1.159119
3    -0.134841  0.390528

In [64]:
df.xs(1,level='Nums') # xs = cross section method

               A         B
Groups
G1      0.302665  1.693723
G2      0.166905  0.184502